{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1},[2,6,10,14,18,22,26,30,34,38],{"id":3,"title":4,"content":5},"post-2023-02-24","Day 12: Combining Phaser and Svelte","## Day 12: Combining Phaser and Svelte\r\n\r\n### **Jeroen**, February 24, 2023\r\n\r\nI'm back to integrating PhaserJS with the MatterJS physics engine, and Svelte.\r\nThe fourth prototype uses some of the domain entities from prototype-003.\r\nAnd it includes a Phaser scene for the actual Pinball machine.\r\n\r\nFor lack of time (the weekend calls for other obligations) I'll just use a static screenshot for the blog:\r\n\r\n[![Game in a browser window](\u002Fimg\u002Fpincrediball-prototype-004-part1.png)](\u002Fimg\u002Fpincrediball-prototype-004-part1.png)\r\n\r\nThe rest of today was spent on trying to make Matter more deterministic.\r\nAnd in that process I got (again) a bit side tracked with [an energy conservation issue](https:\u002F\u002Fgithub.com\u002Fliabru\u002Fmatter-js\u002Fissues\u002F256#issuecomment-1443680697) with MatterJS.\r\n\r\nSo we close off this week with far less results than I'd hoped.\r\nFor a large part because I procrastinated and let myself get side tracked though.\r\nWhat all that does mean is that I need to re-evaluate my goals and approach next week.\r\n\r\nWhat's super important is that the machine becomes more deterministic.\r\nThe whole \"automata player\" and game loop idea falls apart if different runs of the automata have different outcomes.\r\nEither the setup needs to become (more) deterministic, or the game loop has to change.\r\nOr my goals for the project need to change...\r\n\r\nGot a weekend to chew on that though.\r\n",{"id":7,"title":8,"content":9},"post-2023-02-23","Day 11: Sidetracked with Markdown","## Day 11: Sidetracked with Markdown\r\n\r\n### **Jeroen**, February 23, 2023\r\n\r\nI let myself get sidetracked...\r\n\r\nNot sure how much it is to procrastinate working on the actual game.\r\nBut I _am_ sure that it sparked joy to play around with something else.\r\nHere's what I changed up for this pincrediball.com's website source code.\r\n\r\n#### Prose TailwindCSS plugin\r\n\r\nTailwind resets styling, so you can reliably create Web Applications and Sites.\r\nThat's all great, but for long-form textual content it's actually painful to loose _all_ styling.\r\n[The Tailwind \"Prose\" plugin](https:\u002F\u002Ftailwindcss.com\u002Fdocs\u002Ftypography-plugin) aims to solve that, without compromising the reset of styles that Tailwind gives you.\r\n\r\nIt was just fine to write this devlog straight up with html and Tailwind classes.\r\nBut copy-pasting things like `mt-4` on each `\u003Cp\u003E` becomes tedious pretty quickly.\r\nThe Prose plugin fixes that nicely, and cleaned up my devlog source code considerably.\r\n\r\n#### Markdown for blogging\r\n\r\nThis also enables the next step.\r\nMarkdown is a far nicer format to write blogposts in.\r\nI had noticed before that [`svelte.dev` uses markdown for their blog](https:\u002F\u002Fgithub.com\u002Fsveltejs\u002Fsites\u002Ftree\u002Fmaster\u002Fsites\u002Fsvelte.dev\u002Fcontent\u002Fblog),\r\nwhich sparked my interest.\r\n\r\nAfter briefly trying the (rather nice!) [svelte-exmarkdown](https:\u002F\u002Fgithub.com\u002Fssssota\u002Fsvelte-exmarkdown) library, I decided I needed a bit more control.\r\nSo I dove a bit deeper into how `svelte.dev` does things.\r\nAnd that setup is quite nice indeed, as it includes support for SSR and RSS.\r\n\r\nSo, I used a (much) simplified variant of that setup.\r\nAnd: it works like a breeze!\r\nAdding a blog post can now be as simple as [adding one `.md` file to the repository](https:\u002F\u002Fgithub.com\u002Fpincrediball\u002Fpincrediball.com\u002Fcommit\u002F22f4cb509b4c4fbe3b81eb4089af522c21a14bb5)!\r\n\r\n#### What's next?\r\n\r\nThat's all nice!\r\nBut what's next?\r\nShould I ever feel like getting side-tracked again, there's a few things left to tweak:\r\n\r\n- RSS feed would be nice;\r\n- Having `[slug]` based pages might be nice;\r\n- GitHub Action to `npm run build` would be nice;\r\n- GitHub Action to deploy GH-Pages should be nice;\r\n\r\nBut for now: let's stop procrastination and get back to building the game.\r\nShall we?\r\n",{"id":11,"title":12,"content":13},"post-2023-02-22","Day 10: Prototype 003, part 2","## Day 10: Prototype 003, part 2\r\n\r\n### **Jeroen**, February 22, 2023\r\n\r\nWell... that was a disaster!\r\n\r\nAs warned by folks around me, and just as I already sortof knew would happen:\r\n_rolling your own_ (engine) is a bad idea.\r\nGenerally.\r\nAnd specifically, too (at least for this case).\r\n\r\nAfter a few hours of labor here's where I got:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-003.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\nAnd then the mountain of work became visible.\r\n\r\nThe smart thing to do?\r\nEnjoy a few other fun things in my sabbatical, let the project lie down for a bit.\r\nI'll likely revitalize my enthusiasm for the project and go back to using an existing engine.\r\nPossibly within this web app that's now set up.\r\n\r\nStay tuned for prototype _004_ soon (?).\r\nI'm calling it an early day, on Day 10.\r\n",{"id":15,"title":16,"content":17},"post-2023-02-21","Day 9: Prototype 003, part 1","## Day 9: Prototype 003, part 1\r\n\r\n### **Jeroen**, February 21, 2023\r\n\r\nAfter [yesterday](#post-2023-02-20) several friends helped out with some rubber duck debugging.\r\nGot some great input on Slack and in other places about how I could wrangle the physics engine collisions into submission.\r\nAnd how much I should probably let go and embrace the chaos of a realistic engine.\r\n\r\nHowever, I still changed it up... for prototyping purposes!\r\n\r\nUsing PhaserJS and MatterJS might _still_ be the right way to go.\r\nBut I still wanted to try out how it feels to create a fully custom engine anyways.\r\n\r\nAnd while I was at that, I was also curious to see how far I can get with plain html, css, and JavaScript (and no _game_ engine).\r\nUsing SvelteKit and Tailwind, just for prototyping speed at the moment.\r\n\r\nI didn't get very far yet with writing the actual game loop and time ticker.\r\nBut I did do a bunch of good work on an initial game layout.\r\nIt's far from polished, but (even though polish might be 80% of the work?!) that's for later.\r\nHere's the initial results:\r\n\r\n[![Game in a browser window](\u002Fimg\u002Fpincrediball-prototype-003-part1a.png)](\u002Fimg\u002Fpincrediball-prototype-003-part1a.png)\r\n\r\nObviously, this still needs work.\r\nBut it's getting somewhere.\r\nEven if I go the PhaserJS route after all, I might be able to use this setup in conjunction with it.\r\n\r\nAnd I'm sorry to say: that's all for today, folks!\r\n\r\nAs a final footnote for today's devlog: I also decided to open source the prototypes.\r\nSo you can fully see me fumbling about.\r\nWriting all sorts of just-make-it-work code.\r\nYou can find [all the repositories in the Pincrediball GitHub organization](https:\u002F\u002Fgithub.com\u002Fpincrediball).\r\nAnd for my most loyal readers (hi mum!), here's a quick peek at it, with just a random screenshot of me hacking about in prototype number three!\r\n\r\n[![VSCode showing prototype-003 files](\u002Fimg\u002Fpincrediball-prototype-003-part1b.png)](\u002Fimg\u002Fpincrediball-prototype-003-part1b.png)\r\n\r\nPrototype 003 will likely get some more love the coming days.\r\nStay tuned!\r\n",{"id":19,"title":20,"content":21},"post-2023-02-20","Day 8: Prototype 002","## Day 8: Prototype 002\r\n\r\n### **Jeroen**, February 20, 2023\r\n\r\nAfter not doing too much during the weekend (days 6 & 7), it's now Monday of week 2 and high time to get back to the project.\r\nAfter a week of \"meta\" stuff, designing, and a super-light prototype, today was spent on more in-depth prototyping.\r\n\r\nI'm very happy with what I _did_, but only moderately so with the _result_.\r\nHere, have a look for yourself first:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-002.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\n\u003Csmall\u003E(Note that you see the debug boxes and vectors in these prototypes.)\u003C\u002Fsmall\u003E\r\n\r\nLet's summarize what I learned during today's experiments, starting with the positives:\r\n\r\n- ✅ SvelteKit will be a great \"bearer\" of the game\r\n- ✅ Using plain html\u002Fcss\u002Fjs for parts of the app will likely turn out great\r\n- ✅ Tailwind enables for fast menu's and other UI\r\n- ✅ I got _something_ looking like Pinball physics to work\r\n\r\nHowever, I have many concerns after today:\r\n\r\n- ❌ MatterJS physics is wonky ls going _through_ static bounds or getting stuck)\r\n- ❌ Level editing is cumbersome in (vanilla) Phaser, without any tools\r\n- ❌ Curved shapes and SVG paths are a _major_ pain to use\r\n\r\nI'm not so sure yet where to go from here.\r\nHave I learned that I need to go back to my original idea?\r\nBuilding a super-simple physics engine of my own, to make everything far more deterministic and reliable?\r\nOr should I stick with out-of-the-box physics and just deal with the issues?\r\n\r\nPerhaps a night's sleep and some distraction will bring clarity.\r\n",{"id":23,"title":24,"content":25},"post-2023-02-17","Day 5: Prototype 001","## Day 5: Prototype 001\r\n\r\n### **Jeroen**, February 17, 2023\r\n\r\nToday was not a very productive day, mostly because I didn't spend too much time on the project.\r\nStill, got to a very first prototype with a plunger and a ball, plus some physics:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource\r\n    src=\"\u002Fimg\u002Fpincrediball-prototype-001.webm\"\r\n    type=\"video\u002Fwebm; codecs=vp9,vorbis\"\r\n  \u002F\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-001.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\nIt seems the choice for PhaserJS with the MatterJS physics engine is \"good enough\" for my goals.\r\nAnd I think I will just leave it to chance that I chose right, instead of heavily investigating other Game Engines.\r\n\r\nThat's it for day 5.\r\nWeekend's up next, we'll see if I continue work, or whether the next update will come on Monday...\r\n",{"id":27,"title":28,"content":29},"post-2023-02-16","Day 4: Engine's on!","## Day 4: Engine's on!\r\n\r\n### **Jeroen**, February 16, 2023\r\n\r\nToday it's time to figure out an engine to use.\r\nI'm leaning heavily towards [PhaserJS](https:\u002F\u002Fphaser.io\u002F) (the main alternatives being Godot and Unity),\r\nbecause it allows me to tap into my existing web development and JavaScript skills.\r\n\r\nI'm mostly doing tutorials and reading documentation, so no exciting updates from today for the devlog.\r\nThat does give me a minute to share my rough \"plan\" I created earlier in the project.\r\nHere it is:\r\n\r\n[![Brainstorm overview divided in 6 sections: Design, Graphics\u002FArt, Sound\u002FMusic, Game Loop\u002FEngine, Polish, Publish](\u002Fimg\u002Fv2023-02-14a-tipm-brainstorm.png)](\u002Fimg\u002Fv2023-02-14a-tipm-brainstorm.png)\r\n\r\nIt started as a brainstorm, but it became a rough \"plan\".\r\nEach of the six parts is roughly a timebox of one week.\r\nI'm starting with \"Design\" this week, but currently borrowing a bit from the next goal: \"Game Loop \u002F Engine\".\r\n\r\nStuff's color coded too: the red stuff is Must-Haves, yellow Should-Haves, and green the Nice-to-Haves.\r\n\r\nWhat do you think?\r\nToo optimistic?\r\nProbably.\r\nBut let's see how far we'll get, shall we?!\r\n",{"id":31,"title":32,"content":33},"post-2023-02-15","Day 3: Website first?","## Day 3: Website first?\r\n\r\n### **Jeroen**, February 15, 2023\r\n\r\nContinuing from day 2 with a focus on _fun_ activities, I decided to finish up the website.\r\nThis time I don't think I can claim anymore that it's in the end somehow part of the _critical path_ though?\r\n\r\nBut regardless of whether it was _The Right Thing_ to do right now, it _was_ very effective!\r\nI mean: you're looking at the very result right now.\r\n\r\nThe website was built with SvelteKit and TailwindCSS, which was rather efficient because I recently used it for both of my other recent side-projects:\r\n[Tierdom](https:\u002F\u002Ftierdom.jeroenheijmans.nl) and [vesta.infi.nl](https:\u002F\u002Fvesta.infi.nl).\r\nBut not before I spent the entire morning learning some more Figma skills to do the entire design first.\r\n\r\nI only bought the domain name, used\r\n[GitHub pages with a custom and apex domain](https:\u002F\u002Fdocs.github.com\u002Fen\u002Fpages\u002Fconfiguring-a-custom-domain-for-your-github-pages-site\u002Fabout-custom-domains-and-github-pages#using-an-apex-domain-for-your-github-pages-site)\r\nfor hosting the whole thing.\r\nWhich, after the usual DNS hassle, works quite well!\r\n\r\nAll this means three important things:\r\n\r\n- I can _comfortably share_ the plans with the world\r\n- I am _on schedule_ for week 1's plans\r\n- I have _no excuses left_ to procrastinate prototyping\r\n\r\nSo let's end this third day with some initial social media posts and links to this website.\r\n\r\n**And tomorrow: we prototype!**\r\n",{"id":35,"title":36,"content":37},"post-2023-02-14","Day 2: Now we're getting somewhere!","## Day 2: Now we're getting somewhere!\r\n\r\n### **Jeroen**, February 14, 2023\r\n\r\nSecond day I allowed myself to get side-tracked.\r\nI decided that the best way to keep motivation high was by _doing essential things disguised as non-essential things_.\r\nBy this I mean I tried to incorporate essential things (work on the designs and game idea) into far less essential things (that were enjoyable to do).\r\n\r\nFirst thing I did was to **redo the main game screen's design**.\r\nFor fun I've shared that on the (current, at the time of writing) [home page](\u002F).\r\nAfter that I took care of a bunch of other non-essential (but fun!) things:\r\n\r\n- ✅ Logo &amp; Banner designed\r\n- ✅ YouTube channel claimed\r\n- ✅ Itch.io account claimed\r\n- ✅ Socials set up\r\n- ✅ SteamWorks application submitted (and $100 fee paid...)\r\n\r\nIt was a _fun_ day with this too, as you can tell from [my related toot](https:\u002F\u002Fmastodon.social\u002F@jeroenheijmans\u002F109865321998439644).\r\nAnd it really gave me a bunch of inspiration and energy to continue on!\r\n",{"id":39,"title":40,"content":41},"post-2023-02-13","Day 1: Gotta start somewhere!","## Day 1: Gotta start somewhere!\r\n\r\n### **Jeroen**, February 13, 2023\r\n\r\nFirst day of the week I decided to start the project.\r\nHowever, the night before we watched the Super Bowl... in the GMT+1 timezone!\r\nSo was up until 04:30 (that's AM for y'all), naturally this wasn't the most productive day.\r\n\r\nBut the most important thing got done: I got _started_ on the project!\r\nPlus several important things got done nonetheless, as [I wrote on Mastodon](https:\u002F\u002Fmastodon.social\u002F@jeroenheijmans\u002F109859902264743330):\r\n\r\n- ✅ Brainstorm done\r\n- ✅ Rough plan created\r\n- ✅ Name chosen\r\n- ✅ Domain bought!\r\n- ✅ GitHub org and repo's claimed\r\n- ✅ Social media names claimed\r\n- ✅ Game loop basics designed\r\n- ✅ Initial designs\r\n\r\nIn the end would call day 1 a success!\r\n"],"uses":{}}]}
