{"type":"data","nodes":[null,{"type":"data","data":[{"postsGroupedByWeek":1,"posts":106},[2,22,50,78],{"key":3,"posts":4},"2023, week 10",[5,11,17],{"id":6,"isDraft":7,"date":8,"title":9,"content":10},"post-2023-03-11",true,["Date","2023-03-11T00:00:00.000Z"],"(DRAFT) Day 27: Design day","## (DRAFT) Day 27: Design day\r\n\r\n### **Jeroen**, March 11, 2023\r\n\r\nWait what's up!?\r\nA _weekend_ devlog?\r\nThat's a first!\r\n\r\nLet me explain.\r\n\r\nWeek 10 started with an [XXL post on Day 22](#post-2023-03-06).\r\nI set three strict goals to achieve for the day.\r\nBut I still get distracted by other ideas.\r\nThings to procrastinate with.\r\nSo I needed a solution for that.\r\n\r\nI already started a markdown-formatted list of ideas and to-do's on that day.\r\nBut I had no great way to keep those notes.\r\nSo on [Day 23](#post-2023-03-07) I decided to stash them into this blogpost.\r\nThat means the weekend blogpost has been written mostly during the rest of the week.\r\n\r\nI'm not sure yet if I'll keep the list of ideas below in my blogpost.\r\nMost likely I'll reorganize that in the weekend or thereabouts.\r\nMaybe GitHub issues will be a decent place for these things?\r\nWho knows.\r\nFor now I need a dumping ground.\r\n\r\n#### Parked ideas and to-do's\r\n\r\nSo here's a big list of ideas that came up recently:\r\n\r\n- **Ideas for Pincrediball.com**\r\n  I have several ideas to improve this website as well, including:\r\n  - **Dynamic header levels in Markdown**.\r\n    The blog posts _should_ have a `h1` level title.\r\n    This way if I ever create individual blog post pages they'll neatly get a `h1`.\r\n    And for `\u002Fdevlog` where all posts sit on one page, they can be dynamically changed.\r\n    (The markdown plugin allows for overriding the header rendering methods.)\r\n  - **Improve headers setup**.\r\n    Additionally, the headers need tweaking.\r\n    First, the author + date line doesn't need to be a header.\r\n    It can be just an emphasized paragraph.\r\n    That way all subsequent headers can be bumped one level.\r\n    Which makes more sense and is thus good for accessibility.\r\n    Additionally, the `prose` styles will turn out nicer.\r\n  - **Bookmark organization**.\r\n    All my researched bookmarks are in one big dumping folder.\r\n    At the least I should organize them so I can find stuff more easily.\r\n    In addition it might be fun to move the interesting ones straight onto the website.\r\n  - **Terminology infographic**.\r\n    It was hard to find a good visual aid for all Pinball terms.\r\n    Creating one myself would be fun and useful.\r\n- **YouTube uploads**.\r\n  It might be fun to turn some of the prototype videos into some initial content for the YouTube channel?\r\n  Might be better than a completely empty space, also to avoid Google from nullifying the channel.\r\n  (The videos would need some kind of background music though, or else it's _too_ boring.)\r\n- **Chase SvelteHack organizers**.\r\n  Emailed the organizers of [hack.sveltesociety.dev](https:\u002F\u002Fhack.sveltesociety.dev\u002F) a while ago.\r\n  Asked if my projects would qualify, since some light work was done _before_ the official start date.\r\n  Never got a reply, so might be nice to chase that?\r\n  (Although if I go with Godot, the game might be less integrated with the website than what'd be nice for the hackathon.)\r\n- **Reorganize project planning**\r\n  To make sure I get where I want during my vacation, I need to create a planning.\r\n  Set project goals, etc.\r\n  Some things that require thought around this include:\r\n  - **Steam Store Page + Wishlisting**\r\n    If I truly want to aim for releasing something, it would be good to set up a store page rather early.\r\n    So wishlists can grow.\r\n    Heck, perhaps enough traction is even required before Steam is _willing_ to sell my game?\r\n    Anyways, creating a good (enough) Store Page is a fun to do anyways.\r\n\r\nAll those ideas needed to be parked in favor of the three main goals.\r\n",{"id":12,"isDraft":13,"date":14,"title":15,"content":16},"post-2023-03-07",false,["Date","2023-03-07T00:00:00.000Z"],"Day 23: Designing the Tutorial Machine","## Day 23: Designing the Tutorial Machine\r\n\r\n### **Jeroen**, March 07, 2023\r\n\r\n[Yesterday](#post-2023-03-06) was an \"XXL\" day.\r\nFinished very late as well.\r\nSo today I'll go a little easier.\r\n\r\n#### First half of a blogpost\r\n\r\nHere's the goal for today:\r\n\r\n1. Design a \"finished\" tutorial machine.\r\n\r\nThat's it.\r\nJust one goal for today.\r\nI'm starting by writing this first half of the blogpost.\r\nTo gather thoughts and set my goals.\r\nBecause that part did work well, yesterday.\r\n\r\nHere's my thoughts on switching back to \"Designing\" for a bit.\r\n**First up**, I _enjoyed_ doing the designs.\r\nSo it's easy to stay motivated this way.\r\n\r\n**Second**, it will _fixate scope_ for the Pinball Machine components of the Tutorial stage.\r\nSo it should help me keep things small (enough).\r\nAnd free up some mental space, once those things are \"on paper\".\r\n\r\n**Third**, and most importantly:\r\nit should help me _flesh out the core game concepts_.\r\nThe Tutorial machine should \"proof\" that the game loops are _fun_.\r\nOr it will _disproof_ that, and allow me to pivot if needed.\r\n\r\nSo, without further ado, let me get to creating those designs...\r\n\r\n..._a few ~moments~ hours later_:\r\n\r\n#### Second half of a blogpost\r\n\r\nWe're at the end of the day, and there's _some_ result.\r\nNot entirely happy yet, but \"good enough\" for now.\r\n\r\nDecided to \"work backwards\" with level design.\r\nFirst I designed _one configuration_ of the tutorial stage that finishes the last level with at least bronze.\r\nHere's the completed machine, as it's built up from the ground:\r\n\r\n\u003Cvideo controls loop style=\"max-width: 530px\"\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-007-design-buildup.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording the Tutorial Pinball Machine, layer for layer appearing\r\n\u003C\u002Fvideo\u003E\r\n\r\nOuter bounds and background artwork will always be visible to the player.\r\nComponents can be placed nearly anywhere on the field.\r\nThe artwork is supposed to be a guided tutorial for where things could have a nice placement.\r\n\r\nQuests (if ever) can be added to the tutorial by just completing the various goals a set number of time.\r\nThe center artwork could just light up more firmly for each achieved goal.\r\nAnd perhaps increase the multiplier for scores by doing so?\r\n\r\nNext day(s) I will try to move all these components into Godot.\r\nProgramming their features as I go along.\r\nAt some point the entire pinball machine should be \"done\".\r\nI guess if I add keybindings for the flippers I will have made a basic flipper game?\r\n\r\nAfter that I'm planning to add the actual core features:\r\nplayers can move around components, then run playbooks to achieve high scores.\r\nI'm sure to run into design troubles at that stage.\r\n\r\nBut for now, this result will have to do!\r\n\r\n#### Summarizing\r\n\r\nA limited goal for the day, and that worked out just fine!\r\nModerately happy with this result, even though I guess all I did was \"_design a mediocre Pinball Machine_\".\r\nCurious to see if I can _at least_ turn that into a _working_ \"mediocre Pinball game\"...\r\n",{"id":18,"isDraft":13,"date":19,"title":20,"content":21},"post-2023-03-06",["Date","2023-03-06T00:00:00.000Z"],"Day 22: Prototype 007 (XXL devlog)","## Day 22: Prototype 007 (XXL devlog)\r\n\r\n### **Jeroen**, March 06, 2023\r\n\r\nFresh week, fresh energy.\r\nStarted the week by [committing \"publicly\" (on Mastodon) to three small goals for today](https:\u002F\u002Fmastodon.social\u002F@jeroenheijmans\u002F109975463331122581):\r\n\r\n\u003E 1. Design the tutorial machine with initial art\r\n\u003E 2. Put the design into Godot\r\n\u003E 3. Allow plunging a single ball through it\r\n\r\nAdditionally (to \"publicly stating goals\") I'm also going to get all other productivity tricks that work for me going.\r\nOne of which is \"writing my way through it\".\r\nThat is: **I'm going to rubber duck by writing an _extra long devlog_** to keep me going.\r\n\r\n⚠ If you're here for more casual develogs, **then I recommend to stop reading after his paragraph**.\r\n\r\n...\r\n\r\nIf you're here for the full stream-of-consciousness, then saddle in! We're about to dive deep.\r\n\r\n#### 1. Designing the tutorial machine\r\n\r\nDesigning Pinball machines is a skill on its own.\r\nI have no such skill, but I've tried to do a base level of research.\r\nAmongst others, having checked [several PAPAPinball YouTube \"Machine Tutorials\"](https:\u002F\u002Fwww.youtube.com\u002Fwatch?v=XSw7fK6x1mw&list=PL-WQLGFMr97CQpOQDEvRqAiSqcvSuK11h&index=3)\r\nI see several aspects of a good Pinball machine:\r\n\r\n- **Theme** that's appealing (often tied to an existing brand, like \"Batman\" or \"Jurassic Park\");\r\n- **Backplate** with artwork around the theme;\r\n- **Quests**: hitting specific targets in specific orders, in a way that's also fun and challenging;\r\n- **Toys** are extra-special (often gimicky and theme-related) components of the machine that do something crazy when hit;\r\n- **Balance** between how hard goals are to hit (and how big a chance you have to drain the ball), and how many points they give;\r\n- [**Flipper tricks**](https:\u002F\u002Fwww.youtube.com\u002Fwatch?v=r_7TQ6wRZdw&list=PL-WQLGFMr97DnxeE1Rmi-wAwa-Vm7D-7i) should allow skilled players to be better at the game;\r\n- **Multi-ball** mode is usually a goal to work towards, preferably when **\"multipliers\"** are enabled;\r\n- **Basic components** that _must_ be included:\r\n  plunger (with plunger lane and a gate),\r\n  flippers,\r\n  balls,\r\n  lanes,\r\n  spinners,\r\n  bumpers,\r\n  drop targets,\r\n  slingshots,\r\n  and rollovers.\r\n- **Extra components** should probably also be included:\r\n  backbox and display,\r\n  outlanes,\r\n  ramps,\r\n  gates,\r\n  and kickbacks.\r\n- **Skill Shots** (plunging the initial ball at a particular speed to hit a particular target) are perfect for Pincrediball too.\r\n  Especially in the tutorial levels, the \"Playbook\" could contain a precise skill shot.\r\n  This makes it super fun to place the initial components in a very precise location.\r\n\r\nWe'll start with designing the theme, backplate, and quests.\r\nOne theme per \"stage\" of the game, so multiple levels are on the same theme.\r\nThe _Tutorial_ stage is up first.\r\nAlthough I don't have a good term or word for the theme yet, it'll revolve around:\r\n\r\n- Stick figures and a \"math\" paper background;\r\n- A limited color scheme with shades of blue, and some black and white;\r\n- Quests to build up a mini-comic lit up on the backplate;\r\n\r\nAt this point I'll stop writing out my thoughts on this blogpost.\r\nIt's time to grab a tool to design the initial art!\r\n\r\n_...a few ~moments~ hours later_:\r\n\r\n[![Pinball machine in progress](\u002Fimg\u002Fpincrediball-prototype-007-figma.png)](\u002Fimg\u002Fpincrediball-prototype-007-figma.png)\r\n\r\nThis gives me something to work with!\r\nInteresting notes about the design:\r\n\r\n- The plunger lane includes an amber-colored gate that should be \"one-way\" for the ball;\r\n- The three gates at the top are for points, and to be placed by the player in the game to create high scores;\r\n- There's a tiny start for stick-figure art in the main area, which will indicate quest progress;\r\n- I'm a noob at Figma, yet still made it work decently well!\r\n\r\nI want to continue tweaking this design, but I _must_ move on.\r\nThere's still two goals left for today.\r\nTime for a quick break, and then on to the next part.\r\n\r\n#### 2. Putting it into Godot\r\n\r\nFor some reason I figured that having SVG's in Figma would make it easy to import everything into Godot.\r\nI was half right.\r\nThe _wrong_ half.\r\n\r\nImporting the \"Art\" as textures was very easy.\r\n\r\nBut the important half was not so easy; perhaps more research is needed?\r\nI was hoping the SVG paths would be useful as collision shapes.\r\nEspecially the bezier curves seemed logical for a pinball machine.\r\nI set myself certain goals for today, and getting this bit perfect would hold me back.\r\n\r\nSo, I went the labor-intensive route.\r\nImporting the design of the machine in chunks from Figma.\r\nAnd after that... _manually tracing over those shapes again_, to create the collision polygons.\r\nSo...\r\n\r\n_...a few ~moments~ hours later_:\r\n\r\n[![Pinball machine in progress](\u002Fimg\u002Fpincrediball-prototype-007-godot.png)](\u002Fimg\u002Fpincrediball-prototype-007-godot.png)\r\n\r\nThat at least should work to some degree!\r\nLet's have a look, shall we?\r\n\r\n#### 3. Allow plunging a ball\r\n\r\nTime to program a little bit of interactivity.\r\nThe plan was as follows:\r\n\r\n- A \"Plunge\" button that spawns a ball and shoots it into the field;\r\n- **Bonus:** Flippers that just constantly, well, flipper;\r\n\r\nAfter a bunch of trial and error;\r\nafter a ton of Godot 3.x to 4.0 translation;\r\nafter loads of debugging and tweaking;\r\nin short after...\r\n\r\n_...a few ~momnets~ hours later_:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-007.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of a basic pinball machine and dozens of balls\r\n\u003C\u002Fvideo\u003E\r\n\r\nI have a ton of concerns still.\r\nMost notably if this will be deterministic enough for my core game idea.\r\nBut concerns be damned, **I'm pretty content with this result!**\r\n\r\n#### Recap\r\n\r\nIn short, I achieved what I set out to do:\r\n(1) design a machine, (2) put it in Godot, and (3) have basic ball physics.\r\nSetting the goals at the start certainly helped.\r\nTomorrow I might go for a more free-form day, but soon after I'll certainly use this same trick again.\r\n\r\nIf you made it this far into my stream-of-consciousness post:\r\nI salute you!\r\nYou're the best.\r\n\r\nOn to the next bits!\r\n",{"key":23,"posts":24},"2023, week 9",[25,30,35,40,45],{"id":26,"isDraft":13,"date":27,"title":28,"content":29},"post-2023-03-03",["Date","2023-03-03T00:00:00.000Z"],"Day 19: Rest day","## Day 19: Rest day\r\n\r\n### **Jeroen**, March 03, 2023\r\n\r\nGot up an hour later than I wanted.\r\nEnjoyed a visit from a friend, preferred chatting over working on the project.\r\nSome spinning while watching Rick & Morty.\r\nAnd some LEGO Star War with the Mrs.\r\n\r\nIn short: not much game dev was done today.\r\n\r\nPerhaps I'll catch up over the weekend.\r\nOr maybe I'll just reboot next week.\r\nI'm fine with either, it's a _vacation_ project, after all.\r\nWe'll see!\r\n",{"id":31,"isDraft":13,"date":32,"title":33,"content":34},"post-2023-03-02",["Date","2023-03-02T00:00:00.000Z"],"Day 18: Prototype 006 with Godot","## Day 18: Prototype 006 with Godot\r\n\r\n### **Jeroen**, March 02, 2023\r\n\r\nToday I followed advice from friends.\r\nGodot got several more recommendations.\r\nAnd right after I decided to take it for a spin, [Godot 4.0 was released](https:\u002F\u002Fgodotengine.org\u002Farticle\u002Fgodot-4-0-sets-sail\u002F).\r\n\r\n\u003E After 3+ years of breaking and rebuilding from the ground up, a complete core overhaul and a full engine rewrite: **Welcome to the start of Godot 4!**\r\n\r\nSo that's both good and bad.\r\nIt's nice that I join in right when a boost in new modern features is released.\r\n\r\nBut as I suspected, it's less nice that we're now in a state of limbo.\r\nDocumentation has warnings all over the place that they might still be out of date.\r\nOnline examples are thoroughly broken.\r\nAll forum posts and Q&A online still uses the 3.x way of things.\r\n\r\nBut if I download the 3.x LTS version, I'm learning obsolete skills from the get go.\r\nSo Godot 4.0 it was.\r\n\r\n#### Prototype? Mini-game!\r\n\r\nI named it \"prototype 006\" and might still put the code online as such.\r\nBut I mainly set out to just build a tiny game with Godot.\r\n\r\nAs a teenager I'd lie on my back in my room, endlessly tossing a small ball in the air.\r\nThe goal?\r\nTo get as close to the ceiling as possible, _without_ actually hitting it.\r\n\r\nSo I made it into a tiny Godot game.\r\nReally wanted to make it playable in the browser, more on that in a second.\r\nFirst, an example of what it looks like:\r\n\r\n[![Animated gif of a ball bouncing in the air for score](\u002Fimg\u002Fpincrediball-prototype-006.gif)](\u002Fimg\u002Fpincrediball-prototype-006.gif)\r\n\r\nYou press `[SPACE]` or `[LEFT MOUSE BUTTON]` for 0 to 2000 milliseconds to send it flying up.\r\nThe higher you get, the more points you score.\r\nIf you hit the ceiling?\r\nZero points.\r\n\r\nActually fun to build.\r\nMostly without frustration.\r\nBetter than Phaser, certainly.\r\nThis is looking promising!\r\n\r\n#### Godot exports\r\n\r\nThe actual exporting to platforms is a bit more finnicky.\r\nAndroid requires the SDK so I'm yet to try that.\r\niOS similarly likely needs special stuff.\r\n\r\nThe `.exe` Windows version was somehwat easy.\r\nIt includes the entire Godot engine though.\r\nSo my super-simple game becomes 45+ MB: not great.\r\n\r\nThe \"html5\" version is even worse.\r\nThe WASM file also clocks in at similar size.\r\nBut worse: it requires quite modern but certainly not ubiquitous Web Server headers.\r\nThe response from the Godot team was, understandably but frustratingly:\r\n[\"This is a Web Server problem that Web Servers should fix\"](https:\u002F\u002Fgithub.com\u002Fgodotengine\u002Fgodot\u002Fissues\u002F69020#issuecomment-1324253401).\r\n\r\nIt seems that [support for needed headers](https:\u002F\u002Fstackoverflow.com\u002Fq\u002F68609682\u002F419956) won't easily work on GitHub Pages.\r\nSo no runnable version of the game on this devlog for now.\r\n\r\n#### Now what?\r\n\r\nIt'd be really sad if my final game wouldn't run well in browsers.\r\nBoth a demo version on the website, as well as an itch.io version, would be problematic.\r\nBut I don't think I'll let that hold me back.\r\nTomorrow I'll sleep in, and at some point go back to toying with Godot.\r\nMainly because it was _fun_ to do so!\r\n",{"id":36,"isDraft":13,"date":37,"title":38,"content":39},"post-2023-03-01",["Date","2023-03-01T00:00:00.000Z"],"Day 17: Giving up","## Day 17: Giving up\r\n\r\n### **Jeroen**, March 01, 2023\r\n\r\nI'm giving up.\r\n\r\nThe past few days have been extremely frustrating.\r\nI'm spending _days_ on trivial things like [making objects only movable by a player](https:\u002F\u002Fgamedev.stackexchange.com\u002Fquestions\u002F204691\u002Fhow-to-make-object-movable-only-by-the-player).\r\nIn those days I'm also loosing _hours_ on how utterly inconsistent and unpredictable the Phaser and Matter API are for nontrivial things.\r\n\r\nSummarizing those two things differently:\r\n\r\n1. Core Pincrediball concepts are nontrivial in Phaser's physics engine;\r\n2. Phaser itself and its engine are frustrating to work with so far;\r\n\r\nSo I'm giving up.\r\nOn my current approach.\r\n\r\n#### What now then?\r\n\r\nWell, I need to mentally reset.\r\nSo tomorrow I'll start with a completely fresh approach.\r\nNot sure which yet.\r\n\r\nTo end this day with a brainstorm of a few possible roads to take:\r\n\r\n- **Stick with Phaser and MatterJS?**\r\n  Still try to stay with Phaser, revitalize, and try to make Matter physics work for me?\r\n  Probably I should know better, given how frustrated I am right now.\r\n- **Stick with Phaser and a new Physics engine?**\r\n  Stay with Phaser, but see if there's a way to get **Box2D** to work with it?\r\n  I found [the Pinball(!) example](http:\u002F\u002Fphaser.io\u002Fexamples\u002Fv2\u002Fbox2d\u002Fpinball) but it was for the years old version 2 of Phaser.\r\n- **Try out Godot, or Unity?**\r\n  The main alternatives I'd consider (next to very maybe GameMaker).\r\n  I'm just super-worried that I first need a few weeks to learn them.\r\n- **Rolling my own engine?**\r\n  This seemed like a bad idea [after day 10](#post-2023-02-22).\r\n  But perhaps I should give it another go?\r\n- **Quit building, start (more) procrastination?**\r\n  To be honest, I've been enjoying everything _except_ building the damn game a lot.\r\n  The website, the socials, the designs, the (not-yet-existent) Kickstarter...\r\n  Perhaps I should embrace those first?\r\n- **Quit altogether?**\r\n  I have 4 out of 8 weeks left in my mini-sabbatical.\r\n  There's plenty of things to do in those weeks, other than building a game.\r\n\r\nAnd surely there are more options.\r\nI'll sleep on it, and decide when I'm fresh at it again.\r\nIt's not very likely that I'll \"Quit altogether\", but I'm keeping options open:\r\nfirst and foremost I want to be having fun.\r\nAnd, surprise: all through abovementioned frustration, I'm still having fun!\r\n\r\nBut for now, I need a break.\r\n",{"id":41,"isDraft":13,"date":42,"title":43,"content":44},"post-2023-02-28",["Date","2023-02-28T00:00:00.000Z"],"Day 16: Putting it all together","## Day 16: Putting it all together\r\n\r\n### **Jeroen**, February 28, 2023\r\n\r\nSecond day of week 3, and although I _am_ pushing myself through _some_ relevant work, I'm not making the progress I wanted.\r\n\r\nHeck, I'm even writing this recap at the start of day 16.\r\nSo I'm keeping it short, so I can try once more to get some work in.\r\n\r\nWhat I did yesterday is to commit on a setup.\r\nI did not name my repository for the day `prototype-...`.\r\nNo, I actually started the main game repository.\r\nAnd I merged the best bits from earlier prototype.\r\n\r\nThat means the day after this one, there are really no excuses left.\r\nWork has to be done on the game.\r\nLet's get cracking!\r\n\r\nPS. When I procrastinate I try to\r\nwatch [great Phaser tutorials](https:\u002F\u002Fwww.youtube.com\u002F@ourcadetv)\r\nor [Real Life Pinball Machine Tutorials](https:\u002F\u002Fwww.youtube.com\u002Fwatch?v=7ZMPyTqiot4)\r\n(yes, that's a thing...). You might enjoy those too?\r\n",{"id":46,"isDraft":13,"date":47,"title":48,"content":49},"post-2023-02-27",["Date","2023-02-27T00:00:00.000Z"],"Day 15: Prototype 005","## Day 15: Prototype 005\r\n\r\n### **Jeroen**, February 27, 2023\r\n\r\nFirst day of week 3 of the project, day 15 of the project.\r\n\r\nI'm writing an early devlog today.\r\nAfter writing this I will probably _continue_ development.\r\nBut I feel like I reached a checkpoint _now_, so a recap is in order.\r\n\r\n#### Prototype 004\r\n\r\nLooking at the overview of posts you may wonder: \"What happened to prototype 004?\".\r\nGlad you asked!\r\nIn fact, on [Day 12](#post-2023-02-24) I combined Phaser with Svelte;\r\nonly at the end of that day did I \"promote\" it to [its own prototype repository](https:\u002F\u002Fgithub.com\u002Forgs\u002Fpincrediball\u002Frepositories?q=prototype).\r\nQuite likely `prototype-004` will even grow into the end result at some point.\r\n\r\n#### Ladies and Gentlemen: Prototype Number 005!\r\n\r\nSo, today I got up fresh and early.\r\nThe main problem to tackle: **some (more) determinism** in runs.\r\nOtherwise the core game loop (precisely placing parts so you get a high score) is no fun.\r\n\r\nDeterminism turns out to be quite difficult with MatterJS.\r\nBut that's only one problem.\r\nIt has no Continuous Collision Detection (CCD) either, causing the ball at high velocity to go _through_ walls.\r\nThis might get worse once I get to implementing flippers, I suspect.\r\nSo I was doubting my engine choice a bit.\r\n\r\nStill, after a productive morning, I found that things might be good enough for now.\r\nI tweaked the engine settings to a point where many parallel instances of my game would all give the same result.\r\nHere's [the \"proof\" of that](https:\u002F\u002Fgithub.com\u002Fpincrediball\u002Fprototype-005):\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-005.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\nThis prototype made two things clear to me:\r\n\r\n- It gives enough _confidence_ to move forward with my current setup;\r\n- It causes enough _doubt_ that this engine should be the final choice for a _full_ game;\r\n\r\nIn short: a nice check point reached!\r\n\r\n#### What's next?\r\n\r\nSo the next steps are to go \"all in\" on the current approach.\r\nMore specifically, my to do list is currently:\r\n\r\n- Design a good looking tutorial theme and pinball machine;\r\n- Integrate that design, Prototype 004, and Prototype nr. 5;\r\n- Allow the player to move bumpers around\r\n- Add flippers to the game;\r\n\r\nPerhaps a few sound effects to make working on this project a bit more fun too.\r\nI will roll up the rest of today's work in the next devlog entry either way.\r\nStay tuned!\r\n",{"key":51,"posts":52},"2023, week 8",[53,58,63,68,73],{"id":54,"isDraft":13,"date":55,"title":56,"content":57},"post-2023-02-24",["Date","2023-02-24T00:00:00.000Z"],"Day 12: Combining Phaser and Svelte","## Day 12: Combining Phaser and Svelte\r\n\r\n### **Jeroen**, February 24, 2023\r\n\r\nI'm back to integrating PhaserJS with the MatterJS physics engine, and Svelte.\r\nThe fourth prototype uses some of the domain entities from prototype-003.\r\nAnd it includes a Phaser scene for the actual Pinball machine.\r\n\r\nFor lack of time (the weekend calls for other obligations) I'll just use a static screenshot for the blog:\r\n\r\n[![Game in a browser window](\u002Fimg\u002Fpincrediball-prototype-004-part1.png)](\u002Fimg\u002Fpincrediball-prototype-004-part1.png)\r\n\r\nThe rest of today was spent on trying to make Matter more deterministic.\r\nAnd in that process I got (again) a bit side tracked with [an energy conservation issue](https:\u002F\u002Fgithub.com\u002Fliabru\u002Fmatter-js\u002Fissues\u002F256#issuecomment-1443680697) with MatterJS.\r\n\r\nSo we close off this week with far less results than I'd hoped.\r\nFor a large part because I procrastinated and let myself get side tracked though.\r\nWhat all that does mean is that I need to re-evaluate my goals and approach next week.\r\n\r\nWhat's super important is that the machine becomes more deterministic.\r\nThe whole \"automata player\" and game loop idea falls apart if different runs of the automata have different outcomes.\r\nEither the setup needs to become (more) deterministic, or the game loop has to change.\r\nOr my goals for the project need to change...\r\n\r\nGot a weekend to chew on that though.\r\n",{"id":59,"isDraft":13,"date":60,"title":61,"content":62},"post-2023-02-23",["Date","2023-02-23T00:00:00.000Z"],"Day 11: Sidetracked with Markdown","## Day 11: Sidetracked with Markdown\r\n\r\n### **Jeroen**, February 23, 2023\r\n\r\nI let myself get sidetracked...\r\n\r\nNot sure how much it is to procrastinate working on the actual game.\r\nBut I _am_ sure that it sparked joy to play around with something else.\r\nHere's what I changed up for this pincrediball.com's website source code.\r\n\r\n#### Prose TailwindCSS plugin\r\n\r\nTailwind resets styling, so you can reliably create Web Applications and Sites.\r\nThat's all great, but for long-form textual content it's actually painful to loose _all_ styling.\r\n[The Tailwind \"Prose\" plugin](https:\u002F\u002Ftailwindcss.com\u002Fdocs\u002Ftypography-plugin) aims to solve that, without compromising the reset of styles that Tailwind gives you.\r\n\r\nIt was just fine to write this devlog straight up with html and Tailwind classes.\r\nBut copy-pasting things like `mt-4` on each `\u003Cp\u003E` becomes tedious pretty quickly.\r\nThe Prose plugin fixes that nicely, and cleaned up my devlog source code considerably.\r\n\r\n#### Markdown for blogging\r\n\r\nThis also enables the next step.\r\nMarkdown is a far nicer format to write blogposts in.\r\nI had noticed before that [`svelte.dev` uses markdown for their blog](https:\u002F\u002Fgithub.com\u002Fsveltejs\u002Fsites\u002Ftree\u002Fmaster\u002Fsites\u002Fsvelte.dev\u002Fcontent\u002Fblog),\r\nwhich sparked my interest.\r\n\r\nAfter briefly trying the (rather nice!) [svelte-exmarkdown](https:\u002F\u002Fgithub.com\u002Fssssota\u002Fsvelte-exmarkdown) library, I decided I needed a bit more control.\r\nSo I dove a bit deeper into how `svelte.dev` does things.\r\nAnd that setup is quite nice indeed, as it includes support for SSR and RSS.\r\n\r\nSo, I used a (much) simplified variant of that setup.\r\nAnd: it works like a breeze!\r\nAdding a blog post can now be as simple as [adding one `.md` file to the repository](https:\u002F\u002Fgithub.com\u002Fpincrediball\u002Fpincrediball.com\u002Fcommit\u002F22f4cb509b4c4fbe3b81eb4089af522c21a14bb5)!\r\n\r\n#### What's next?\r\n\r\nThat's all nice!\r\nBut what's next?\r\nShould I ever feel like getting side-tracked again, there's a few things left to tweak:\r\n\r\n- RSS feed would be nice;\r\n- Having `[slug]` based pages might be nice;\r\n- GitHub Action to `npm run build` would be nice;\r\n- GitHub Action to deploy GH-Pages should be nice;\r\n\r\nBut for now: let's stop procrastination and get back to building the game.\r\nShall we?\r\n",{"id":64,"isDraft":13,"date":65,"title":66,"content":67},"post-2023-02-22",["Date","2023-02-22T00:00:00.000Z"],"Day 10: Prototype 003, part 2","## Day 10: Prototype 003, part 2\r\n\r\n### **Jeroen**, February 22, 2023\r\n\r\nWell... that was a disaster!\r\n\r\nAs warned by folks around me, and just as I already sortof knew would happen:\r\n_rolling your own_ (engine) is a bad idea.\r\nGenerally.\r\nAnd specifically, too (at least for this case).\r\n\r\nAfter a few hours of labor here's where I got:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-003.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\nAnd then the mountain of work became visible.\r\n\r\nThe smart thing to do?\r\nEnjoy a few other fun things in my sabbatical, let the project lie down for a bit.\r\nI'll likely revitalize my enthusiasm for the project and go back to using an existing engine.\r\nPossibly within this web app that's now set up.\r\n\r\nStay tuned for prototype _004_ soon (?).\r\nI'm calling it an early day, on Day 10.\r\n",{"id":69,"isDraft":13,"date":70,"title":71,"content":72},"post-2023-02-21",["Date","2023-02-21T00:00:00.000Z"],"Day 9: Prototype 003, part 1","## Day 9: Prototype 003, part 1\r\n\r\n### **Jeroen**, February 21, 2023\r\n\r\nAfter [yesterday](#post-2023-02-20) several friends helped out with some rubber duck debugging.\r\nGot some great input on Slack and in other places about how I could wrangle the physics engine collisions into submission.\r\nAnd how much I should probably let go and embrace the chaos of a realistic engine.\r\n\r\nHowever, I still changed it up... for prototyping purposes!\r\n\r\nUsing PhaserJS and MatterJS might _still_ be the right way to go.\r\nBut I still wanted to try out how it feels to create a fully custom engine anyways.\r\n\r\nAnd while I was at that, I was also curious to see how far I can get with plain html, css, and JavaScript (and no _game_ engine).\r\nUsing SvelteKit and Tailwind, just for prototyping speed at the moment.\r\n\r\nI didn't get very far yet with writing the actual game loop and time ticker.\r\nBut I did do a bunch of good work on an initial game layout.\r\nIt's far from polished, but (even though polish might be 80% of the work?!) that's for later.\r\nHere's the initial results:\r\n\r\n[![Game in a browser window](\u002Fimg\u002Fpincrediball-prototype-003-part1a.png)](\u002Fimg\u002Fpincrediball-prototype-003-part1a.png)\r\n\r\nObviously, this still needs work.\r\nBut it's getting somewhere.\r\nEven if I go the PhaserJS route after all, I might be able to use this setup in conjunction with it.\r\n\r\nAnd I'm sorry to say: that's all for today, folks!\r\n\r\nAs a final footnote for today's devlog: I also decided to open source the prototypes.\r\nSo you can fully see me fumbling about.\r\nWriting all sorts of just-make-it-work code.\r\nYou can find [all the repositories in the Pincrediball GitHub organization](https:\u002F\u002Fgithub.com\u002Fpincrediball).\r\nAnd for my most loyal readers (hi mum!), here's a quick peek at it, with just a random screenshot of me hacking about in prototype number three!\r\n\r\n[![VSCode showing prototype-003 files](\u002Fimg\u002Fpincrediball-prototype-003-part1b.png)](\u002Fimg\u002Fpincrediball-prototype-003-part1b.png)\r\n\r\nPrototype 003 will likely get some more love the coming days.\r\nStay tuned!\r\n",{"id":74,"isDraft":13,"date":75,"title":76,"content":77},"post-2023-02-20",["Date","2023-02-20T00:00:00.000Z"],"Day 8: Prototype 002","## Day 8: Prototype 002\r\n\r\n### **Jeroen**, February 20, 2023\r\n\r\nAfter not doing too much during the weekend (days 6 & 7), it's now Monday of week 2 and high time to get back to the project.\r\nAfter a week of \"meta\" stuff, designing, and a super-light prototype, today was spent on more in-depth prototyping.\r\n\r\nI'm very happy with what I _did_, but only moderately so with the _result_.\r\nHere, have a look for yourself first:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-002.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\n\u003Csmall\u003E(Note that you see the debug boxes and vectors in these prototypes.)\u003C\u002Fsmall\u003E\r\n\r\nLet's summarize what I learned during today's experiments, starting with the positives:\r\n\r\n- ✅ SvelteKit will be a great \"bearer\" of the game\r\n- ✅ Using plain html\u002Fcss\u002Fjs for parts of the app will likely turn out great\r\n- ✅ Tailwind enables for fast menu's and other UI\r\n- ✅ I got _something_ looking like Pinball physics to work\r\n\r\nHowever, I have many concerns after today:\r\n\r\n- ❌ MatterJS physics is wonky ls going _through_ static bounds or getting stuck)\r\n- ❌ Level editing is cumbersome in (vanilla) Phaser, without any tools\r\n- ❌ Curved shapes and SVG paths are a _major_ pain to use\r\n\r\nI'm not so sure yet where to go from here.\r\nHave I learned that I need to go back to my original idea?\r\nBuilding a super-simple physics engine of my own, to make everything far more deterministic and reliable?\r\nOr should I stick with out-of-the-box physics and just deal with the issues?\r\n\r\nPerhaps a night's sleep and some distraction will bring clarity.\r\n",{"key":79,"posts":80},"2023, week 7",[81,86,91,96,101],{"id":82,"isDraft":13,"date":83,"title":84,"content":85},"post-2023-02-17",["Date","2023-02-17T00:00:00.000Z"],"Day 5: Prototype 001","## Day 5: Prototype 001\r\n\r\n### **Jeroen**, February 17, 2023\r\n\r\nToday was not a very productive day, mostly because I didn't spend too much time on the project.\r\nStill, got to a very first prototype with a plunger and a ball, plus some physics:\r\n\r\n\u003Cvideo controls loop\u003E\r\n  \u003Csource\r\n    src=\"\u002Fimg\u002Fpincrediball-prototype-001.webm\"\r\n    type=\"video\u002Fwebm; codecs=vp9,vorbis\"\r\n  \u002F\u003E\r\n  \u003Csource src=\"\u002Fimg\u002Fpincrediball-prototype-001.mp4\" type=\"video\u002Fmp4\" \u002F\u003E\r\n  Video recording of an extremely crude demo pinball machine.\r\n\u003C\u002Fvideo\u003E\r\n\r\nIt seems the choice for PhaserJS with the MatterJS physics engine is \"good enough\" for my goals.\r\nAnd I think I will just leave it to chance that I chose right, instead of heavily investigating other Game Engines.\r\n\r\nThat's it for day 5.\r\nWeekend's up next, we'll see if I continue work, or whether the next update will come on Monday...\r\n",{"id":87,"isDraft":13,"date":88,"title":89,"content":90},"post-2023-02-16",["Date","2023-02-16T00:00:00.000Z"],"Day 4: Engine's on!","## Day 4: Engine's on!\r\n\r\n### **Jeroen**, February 16, 2023\r\n\r\nToday it's time to figure out an engine to use.\r\nI'm leaning heavily towards [PhaserJS](https:\u002F\u002Fphaser.io\u002F) (the main alternatives being Godot and Unity),\r\nbecause it allows me to tap into my existing web development and JavaScript skills.\r\n\r\nI'm mostly doing tutorials and reading documentation, so no exciting updates from today for the devlog.\r\nThat does give me a minute to share my rough \"plan\" I created earlier in the project.\r\nHere it is:\r\n\r\n[![Brainstorm overview divided in 6 sections: Design, Graphics\u002FArt, Sound\u002FMusic, Game Loop\u002FEngine, Polish, Publish](\u002Fimg\u002Fv2023-02-14a-tipm-brainstorm.png)](\u002Fimg\u002Fv2023-02-14a-tipm-brainstorm.png)\r\n\r\nIt started as a brainstorm, but it became a rough \"plan\".\r\nEach of the six parts is roughly a timebox of one week.\r\nI'm starting with \"Design\" this week, but currently borrowing a bit from the next goal: \"Game Loop \u002F Engine\".\r\n\r\nStuff's color coded too: the red stuff is Must-Haves, yellow Should-Haves, and green the Nice-to-Haves.\r\n\r\nWhat do you think?\r\nToo optimistic?\r\nProbably.\r\nBut let's see how far we'll get, shall we?!\r\n",{"id":92,"isDraft":13,"date":93,"title":94,"content":95},"post-2023-02-15",["Date","2023-02-15T00:00:00.000Z"],"Day 3: Website first?","## Day 3: Website first?\r\n\r\n### **Jeroen**, February 15, 2023\r\n\r\nContinuing from day 2 with a focus on _fun_ activities, I decided to finish up the website.\r\nThis time I don't think I can claim anymore that it's in the end somehow part of the _critical path_ though?\r\n\r\nBut regardless of whether it was _The Right Thing_ to do right now, it _was_ very effective!\r\nI mean: you're looking at the very result right now.\r\n\r\nThe website was built with SvelteKit and TailwindCSS, which was rather efficient because I recently used it for both of my other recent side-projects:\r\n[Tierdom](https:\u002F\u002Ftierdom.jeroenheijmans.nl) and [vesta.infi.nl](https:\u002F\u002Fvesta.infi.nl).\r\nBut not before I spent the entire morning learning some more Figma skills to do the entire design first.\r\n\r\nI only bought the domain name, used\r\n[GitHub pages with a custom and apex domain](https:\u002F\u002Fdocs.github.com\u002Fen\u002Fpages\u002Fconfiguring-a-custom-domain-for-your-github-pages-site\u002Fabout-custom-domains-and-github-pages#using-an-apex-domain-for-your-github-pages-site)\r\nfor hosting the whole thing.\r\nWhich, after the usual DNS hassle, works quite well!\r\n\r\nAll this means three important things:\r\n\r\n- I can _comfortably share_ the plans with the world\r\n- I am _on schedule_ for week 1's plans\r\n- I have _no excuses left_ to procrastinate prototyping\r\n\r\nSo let's end this third day with some initial social media posts and links to this website.\r\n\r\n**And tomorrow: we prototype!**\r\n",{"id":97,"isDraft":13,"date":98,"title":99,"content":100},"post-2023-02-14",["Date","2023-02-14T00:00:00.000Z"],"Day 2: Now we're getting somewhere!","## Day 2: Now we're getting somewhere!\r\n\r\n### **Jeroen**, February 14, 2023\r\n\r\nSecond day I allowed myself to get side-tracked.\r\nI decided that the best way to keep motivation high was by _doing essential things disguised as non-essential things_.\r\nBy this I mean I tried to incorporate essential things (work on the designs and game idea) into far less essential things (that were enjoyable to do).\r\n\r\nFirst thing I did was to **redo the main game screen's design**.\r\nFor fun I've shared that on the (current, at the time of writing) [home page](\u002F).\r\nAfter that I took care of a bunch of other non-essential (but fun!) things:\r\n\r\n- ✅ Logo &amp; Banner designed\r\n- ✅ YouTube channel claimed\r\n- ✅ Itch.io account claimed\r\n- ✅ Socials set up\r\n- ✅ SteamWorks application submitted (and $100 fee paid...)\r\n\r\nIt was a _fun_ day with this too, as you can tell from [my related toot](https:\u002F\u002Fmastodon.social\u002F@jeroenheijmans\u002F109865321998439644).\r\nAnd it really gave me a bunch of inspiration and energy to continue on!\r\n",{"id":102,"isDraft":13,"date":103,"title":104,"content":105},"post-2023-02-13",["Date","2023-02-13T00:00:00.000Z"],"Day 1: Gotta start somewhere!","## Day 1: Gotta start somewhere!\r\n\r\n### **Jeroen**, February 13, 2023\r\n\r\nFirst day of the week I decided to start the project.\r\nHowever, the night before we watched the Super Bowl... in the GMT+1 timezone!\r\nSo was up until 04:30 (that's AM for y'all), naturally this wasn't the most productive day.\r\n\r\nBut the most important thing got done: I got _started_ on the project!\r\nPlus several important things got done nonetheless, as [I wrote on Mastodon](https:\u002F\u002Fmastodon.social\u002F@jeroenheijmans\u002F109859902264743330):\r\n\r\n- ✅ Brainstorm done\r\n- ✅ Rough plan created\r\n- ✅ Name chosen\r\n- ✅ Domain bought!\r\n- ✅ GitHub org and repo's claimed\r\n- ✅ Social media names claimed\r\n- ✅ Game loop basics designed\r\n- ✅ Initial designs\r\n\r\nIn the end would call day 1 a success!\r\n",[5,11,17,25,30,35,40,45,53,58,63,68,73,81,86,91,96,101]],"uses":{}}]}
